flowPastSphereRe100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

HHalf   5;
LL      5;
LR      10;
BHalf   5;
nB      20;
nH      20;
nL      30;

vertices
(
    (-$LL -$HHalf -$BHalf) // 0
    ( $LR -$HHalf -$BHalf) // 1
    ( $LR  $HHalf -$BHalf) // 2
    (-$LL  $HHalf -$BHalf) // 3
    (-$LL -$HHalf  $BHalf) // 4
    ( $LR -$HHalf  $BHalf) // 5
    ( $LR  $HHalf  $BHalf) // 6
    (-$LL  $HHalf  $BHalf) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nL $nH $nB) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
	sides
    {
        type wall;
        faces
        (
            (0 1 5 4)
			(4 5 6 7)
			(3 7 6 2)
			(0 3 2 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
